//=============================================================================
//
// ファイル	: モーフィング処理 [morphing.cpp]
// Author	: 東京　GP 006 AUNG PYAE SAN
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MODEL_MAX	(5)
#define MAX_MORPHIN		(8)					// エネミーの数
#define MORPHIN_SIZE	(5.0f)

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct MORPHING
{
	BOOL			load;	// ロード完了フラグ
	BOOL			use;	// モデルのuse
	float			time;	// 線形補間用のタイマー
	float			size;				// 当たり判定の大きさ

	int				sign;	// 線形補間用の符号
	int				index;	// 線形補間用のモデル番号
	int				shadowIdx;			// 影のインデックス番号

	DX11_MODEL		model;	// モデルデータ

	XMFLOAT3		pos;	// 座標
	XMFLOAT3		rot;	// 回転
	XMFLOAT3		scl;	// 拡縮
	XMFLOAT4X4		mtxWorld;			// ワールドマトリックス


	// padding 4byte

	XMFLOAT4		diffuse[MODEL_MAX_MATERIAL];	// 色

	// 344バイト
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitMorphing(void);
void UninitMorphing(void);
void UpdateMorphing(void);
void DrawMorphing(void);

MORPHING *GetMorphing(void);
